zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/DSC/MC56F80xxx/MC56F80748/drivers/fsl_clock.h
/*! @brief Describes EWM clock source. */
typedef enum _ewm_lpo_clock_source
{
    /* This part is used for EWM driver. */
    kEWM_LpoClockSource0 = 0U, /*!< EWM clock sourced from lpo_clk[0] */
    kEWM_LpoClockSource1 = 1U, /*!< EWM clock sourced from lpo_clk[1] */
    kEWM_LpoClockSource2 = 2U, /*!< EWM clock sourced from lpo_clk[2] */
    kEWM_LpoClockSource3 = 3U, /*!< EWM clock sourced from lpo_clk[3] */
    /* This part is used for users. */
    kEWM_Lpo8MHz2MHzIRCClock = kEWM_LpoClockSource0, /*!< EWM clock sourced from 8MHz/2MHz IRC clock */
    kEWM_LpoCrystalClock     = kEWM_LpoClockSource1, /*!< EWM clock sourced from crystal clock */
    kEWM_LpoBusClock         = kEWM_LpoClockSource2, /*!< EWM clock sourced from IP Bus clock */
    kEWM_Lpo200KHzIRCClock   = kEWM_LpoClockSource3, /*!< EWM clock sourced from 200KHz IRC clock */
} ewm_lpo_clock_source_t;

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @brief Clock ip name array for GPIO. */
#define GPIO_CLOCKS                                                                        \
    {                                                                                      \
        kCLOCK_GPIOA, kCLOCK_GPIOB, kCLOCK_GPIOC, kCLOCK_GPIOD, kCLOCK_GPIOE, kCLOCK_GPIOF \
    }

/*! @brief Clock ip name array for quad timer. */
#define TMR_CLOCKS                                     \
    {                                                  \
        kCLOCK_TA0, kCLOCK_TA1, kCLOCK_TA2, kCLOCK_TA3 \
    }

/*! @brief Clock ip name array for LPI2C. */
#define LPI2C_CLOCKS  \
    {                 \
        kCLOCK_LPI2C0 \
    }

/*! @brief Clock ip name array for queued SPI. */
#define QSPI_CLOCKS  \
    {                \
        kCLOCK_QSPI0 \
    }

/*! @brief Clock ip name array for queued SCI. */
#define QSCI_CLOCKS                \
    {                              \
        kCLOCK_QSCI0, kCLOCK_QSCI1 \
    }

/*! @brief Clock ip name array for PIT. */
#define PIT_CLOCKS                            \
    {                                         \
        kCLOCK_PIT0, kCLOCK_PIT1, kCLOCK_PIT2 \
    }

/*! @brief Clock ip name array for QDC. */
#define QDC_CLOCKS \
    {              \
        kCLOCK_QDC \
    }

/*! @brief Clock ip name array for CRC. */
#define CRC_CLOCKS \
    {              \
        kCLOCK_CRC \
    }

/*! @brief Clock ip name array for cyclic ADC. */
#define CADC_CLOCKS   \
    {                 \
        kCLOCK_CYCADC \
    }

/*! @brief Clock ip name array for CMP. */
#define CMP_CLOCKS                            \
    {                                         \
        kCLOCK_CMPA, kCLOCK_CMPB, kCLOCK_CMPC \
    }

/*! @brief Clock ip name array for PWM. */
#define PWM_CLOCKS                                                         \
    {                                                                      \
        {                                                                  \
            kCLOCK_PWMACH0, kCLOCK_PWMACH1, kCLOCK_PWMACH2, kCLOCK_PWMACH3 \
        }                                                                  \
    }

/*! @brief Clock ip name array for OPAMP. */
#define OPAMP_CLOCKS                 \
    {                                \
        kCLOCK_OPAMPA, kCLOCK_OPAMPB \
    }

/*! @brief Clock ip name array for EDMA. */
#define EDMA_CLOCKS \
    {               \
        kCLOCK_EDMA \
    }

/*! @brief Clock ip name array for EWM. */
#define EWM_CLOCKS \
    {              \
        kCLOCK_EWM \
    }

/*! @brief Clock ip name array for XBARA. */
#define XBARA_CLOCKS \
    {                \
        kCLOCK_XBARA \
    }

#define CLK_GATE_GET_REG_INDEX(x) (((uint16_t)(x)) >> 4)
#define CLK_GATE_GET_BIT_INDEX(x) (((uint16_t)(x)) & 0x0FU)

#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/*!
 * @brief Enable IPs clock.
 *
 * @param eIpClkName IP clock name.
 */
static inline void CLOCK_EnableClock(clock_ip_name_t eIpClkName)
{
    assert(eIpClkName < kCLOCK_NUM);
    if (eIpClkName != kCLOCK_NOGATE)
    {
        ((volatile uint16_t *)(&(SIM->PCE0)))[CLK_GATE_GET_REG_INDEX(eIpClkName)] |=
            (uint16_t)(1UL << CLK_GATE_GET_BIT_INDEX(eIpClkName));
    }
}

/*!
 * @brief Disable IPs clock.
 *
 * @param eIpClkName IP clock name.
 */
static inline void CLOCK_DisableClock(clock_ip_name_t eIpClkName)
{
    assert(eIpClkName < kCLOCK_NUM);
    if (eIpClkName != kCLOCK_NOGATE)
    {
        ((volatile uint16_t *)(&(SIM->PCE0)))[CLK_GATE_GET_REG_INDEX(eIpClkName)] &=
            ~((uint16_t)(1UL << CLK_GATE_GET_BIT_INDEX(eIpClkName)));
    }
}

/*!
 * @brief Enable IPs clock in STOP mode.
 *
 * @param eIpClkName IP clock name.
 */
static inline void CLOCK_EnableClockInStopMode(clock_ip_name_t eIpClkName)
{
    assert(eIpClkName < kCLOCK_NUM);
    if (eIpClkName != kCLOCK_NOGATE)
    {
        ((volatile uint16_t *)(&(SIM->SD0)))[CLK_GATE_GET_REG_INDEX(eIpClkName)] |=
            (uint16_t)(1UL << CLK_GATE_GET_BIT_INDEX(eIpClkName));
    }
}

/*!
 * @brief Disable IPs clock in STOP mode.
 *
 * @param eIpClkName IP clock name.
 */
static inline void CLOCK_DisableClockInStopMode(clock_ip_name_t eIpClkName)
{
    assert(eIpClkName < kCLOCK_NUM);
    if (eIpClkName != kCLOCK_NOGATE)
    {
        ((volatile uint16_t *)(&(SIM->SD0)))[CLK_GATE_GET_REG_INDEX(eIpClkName)] &=
            ~((uint16_t)(1UL << CLK_GATE_GET_BIT_INDEX(eIpClkName)));
    }
}

/*!
 * @brief Configure QSCI clock source.
 *
 * QSCI clock could be bus or bus_2x clock. Default is bus clock.
 *
 * @param eQsciClkName IP(only QSCI is valid) clock name.
 * @param eClkSrc Clock source.
 */
static inline void CLOCK_ConfigQsciClockSrc(clock_ip_name_t eQsciClkName, clock_ip_clk_src_t eClkSrc)
{
    if (0U == (SIM->MISC0 & SIM_MISC0_MODE_STAT_MASK))
    {
        assert((eQsciClkName <= kCLOCK_QSCI0) && (eQsciClkName >= kCLOCK_QSCI1));
        if (kCLOCK_IPClkSrc_Bus2xClk == eClkSrc)
        {
            SIM->PCR |= (uint16_t)(1UL << (SIM_PCR_SCI0_CR_SHIFT + (uint16_t)eQsciClkName - (uint16_t)kCLOCK_QSCI0));
        }
        else
        {
            SIM->PCR &= ~((uint16_t)(1UL << (SIM_PCR_SCI0_CR_SHIFT + (uint16_t)eQsciClkName - (uint16_t)kCLOCK_QSCI0)));
        }
    }
}

/*!
 * @brief Configure LPI2C clock source.
 *
 * LPI2C clock could be bus or bus_2x clock. Default is bus clock.
 *
 * @param eClkSrc Clock source.
 */
static inline void CLOCK_ConfigI2cClockSrc(clock_ip_clk_src_t eClkSrc)
{
    if (0U == (SIM->MISC0 & SIM_MISC0_MODE_STAT_MASK))
    {
        /* LPI2C could be configured only when normal mode */
        if (kCLOCK_IPClkSrc_Bus2xClk == eClkSrc)
        {
            SIM->PCR |= SIM_PCR_LPI2C0_CR_MASK;
        }
        else
        {
            SIM->PCR &= ~SIM_PCR_LPI2C0_CR_MASK;
        }
    }
}

/*!
 * @brief Set trim value to 200K slow internal RC oscillator.
 *
 * The factory trim value is loaded during reset.
 * User may call this function to fine tune the 200K IRC oscillator.
 *
 * @param u16Trim Slow internal RC oscillator trim value.
 */
static inline void CLOCK_SetSlowIrcTrim(uint16_t u16Trim)
{
    OCCS->OSCTL2 = (OCCS->OSCTL2 & (~OCCS_OSCTL2_FREQ_TRIM200K_MASK)) | OCCS_OSCTL2_FREQ_TRIM200K(u16Trim);
}

/*!
 * @brief Set trim value to fast internal RC 8M oscillator.
 *
 * The factory trim value is loaded during reset.
 * User may call this function to fine tune the FIRC 8M oscillator.
 *
 * @param u16Trim Fast internal 8M RC oscillator trim value. Check OSCTL3 register for u16Trim format.
 */
static inline void CLOCK_SetFastIrc8MTrim(uint16_t u16Trim)
{
    OCCS->OSCTL3 = u16Trim;
}

/*!
 * @brief Set trim value to fast internal RC 2M oscillator.
 *
 * The factory trim value is loaded during reset.
 * User may call this function to fine tune the FIRC 2M oscillator.
 *
 * @param u16Trim Fast internal 2M RC oscillator trim value. Check OSCTL4 register for u16Trim format.
 */
static inline void CLOCK_SetFastIrc2MTrim(uint16_t u16Trim)
{
    OCCS->OSCTL4 = u16Trim;
}

/*!
 * @brief Get crystal oscillator failure status.
 *
 * @note This function should be called only when crystal osc is on and its monitor(MON_ENABLE in OSCTL2 register) is
 * enabled.
 *
 * @return Crystal oscillator status.
 *         true: Crystal oscillator frequency is below 680KHz(typical).
 *         false: No clock failure or crystal oscillator is off.
 */
static inline bool CLOCK_GetCrystalOscFailureStatus(void)
{
    return (0U != (OCCS->STAT & OCCS_STAT_MON_FAILURE_MASK));
}

/*!
 * @brief Set PLL loss of reference trip point.
 *
 * The trip point default value is 2.
 *
 * @param u8Trip Trip point for loss of reference.
 */
static inline void CLOCK_SetPllLossofRefererntTripPoint(uint8_t u8Trip)
{
    OCCS->DIVBY = (OCCS->DIVBY & (~OCCS_DIVBY_LORTP_MASK)) | OCCS_DIVBY_LORTP(u8Trip);
}

/*!
 * @brief Clear PLL monitor flag.
 *
 * @param eType PLL monitor type.
 */
static inline void CLOCK_ClearPLLMonitorFlag(clock_pll_monitor_type_t eType)
{
    switch (eType)
    {
        case kCLOCK_PllMonitorUnLockCoarse:
            OCCS->STAT = OCCS_STAT_LOLI0_MASK;
            break;

        case kCLOCK_PllMonitorUnLockFine:
            OCCS->STAT = OCCS_STAT_LOLI1_MASK;
            break;

        case kCLOCK_PllMonitorLostofReferClk:
            OCCS->STAT = OCCS_STAT_LOCI_MASK;
            break;

        case kCLOCK_PllMonitorAll:
            OCCS->STAT = OCCS_STAT_LOLI0_MASK | OCCS_STAT_LOLI1_MASK | OCCS_STAT_LOCI_MASK;
            break;

        default:
            assert(false);
            break;
    }
}

/*!
 * @brief Enable/Disable FIRC output.
 *
 * Note: It is not allowed to disable FIRC output when FIRC is selected as master osc clock source.
 * Note: Disable FIRC output doesn't turn off FIRC, FIRC still works but its output is cut off.
 * Note: For the case FIRC is powered on and output disabled, enable FIRC output doesn't require startup time.
 *
 * @param bEnable Enable or disable output.
 */
static inline void CLOCK_EnableFircOutput(bool bEnable)
{
    if (bEnable)
    {
        OCCS->OSCTL1 &= ~OCCS_OSCTL1_CLK_STOP_MASK;
    }
    else
    {
        assert((OCCS->CTRL & OCCS_CTRL_PRECS_MASK) != OCCS_CTRL_PRECS(kCLOCK_MstrOscClkSrcFirc));
        OCCS->OSCTL1 |= OCCS_OSCTL1_CLK_STOP_MASK;
    }
}

/*!
 * @brief Get system-level clock frequency.
 *
 * @param eClkName System-level clock name.
 *
 * @return The required clock's frequency in Hz.
 */
uint32_t CLOCK_GetFreq(clock_name_t eClkName);

/*!
 * @brief Get IP clock frequency.
 *
 * @param eIpClkName IP clock name.
 *
 * @return The required IP clock's frequency in Hz.
 */
uint32_t CLOCK_GetIpClkSrcFreq(clock_ip_name_t eIpClkName);

/*!
 * @brief Set Clock IN 0 frequency.
 *
 * It is a must to call this function in advance if system is operated by clkin0.
 *
 * @param u32Freq Clock IN 0 frequency in Hz.
 */
void CLOCK_SetClkin0Freq(uint32_t u32Freq);

/*!
 * @brief Set Clock IN 1 frequency.
 *
 * It is a must to call this function in advance if system is operated by clkin1.
 *
 * @param u32Freq Clock IN 1 frequency in Hz.
 */
void CLOCK_SetClkin1Freq(uint32_t u32Freq);

/*!
 * @brief Set crystal oscillator frequency.
 *
 * It is a must to call this function in advance if system is operated by crystal oscillator.
 *
 * @param u32Freq Crystal oscillator frequency in Hz.
 */
void CLOCK_SetXtalFreq(uint32_t u32Freq);

/*!
 * @brief Config clock register access protection mode.
 *
 * @param psConfig Pointer for protection configuration.
 */
void CLOCK_SetProtectionConfig(clock_protection_config_t *psConfig);

/*!
 * @brief Config output clock.
 *
 * @param psConfig Pointer for clock output configuration.
 */
void CLOCK_SetOutputClockConfig(clock_output_config_t *psConfig);

/*!
 * @brief Config mcu operation clock.
 *
 * @param psConfig Pointer for clock configuration.
 */
void CLOCK_SetClkConfig(clock_config_t *psConfig);

/*!
 * @brief Evaluate external clock frequency and return its frequency in Hz.
 *
 * This function should be called only when internal FIRC is on and 8M is selected.
 * The evaluated result accuracy depends on:
 * 1. FIRC accuracy, now it is +/-3% for full temperature range.
 * 2. Truncation error, because the external clock and FIRC is not synchronised.
 * 3. External clock frequency, low accuracy for lower external clock frequency.
 * 4. MCU mstr 2x clock.
 *
 * For example, for namely 8M external clock, evaluated result may be range in 8M+/-7%.
 *
 * @return Evaluated external frequency in Hz.
 */
uint32_t CLOCK_EvaluateExtClkFreq(void);

/*!
 * @brief Enable/Disable PLL monitor interrupt.
 *
 * This function should be called only when PLL is on and its reference clock is external clock.
 * This function is for safety purpose when external clock is lost due to HW failure.
 * The normal flow to call this function:
 * 1. Call CLOCK_SetClkConfig to enable PLL and external clock to feed the PLL.
 * 2. Call CLOCK_ClearPLLMonitorFlag.
 * 3. Call CLOCK_SetPllLossofRefererntTripPoint (optional, setting value is for kCLOCK_PllMonitorLostofReferClk type).
 * 4. Call this function.
 * 5. Enable OCCS interrupt with highest priority 3.
 * 6. When OCCS interrupt occurs, recover clock from the disaster in OCCS_DriveISRHandler function. Such kind of clock
 * recovery is application dependent, and a demo OCCS_DriveISRHandler has been shown in fsl_clock.c
 *
 * @param eType PLL monitor type.
 * @param bEnable Enable or disable.
 */
void CLOCK_EnablePLLMonitorInterrupt(clock_pll_monitor_type_t eType, bool bEnable);

#if defined(__cplusplus)
}
#endif /* __cplusplus */

/*! @} */

#endif /* _FSL_CLOCK_H_ */
